run/blockMesh_Test_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       81590;
    }
    outlet
    {
        type            patch;
        nFaces          210;
        startFace       81990;
    }
    foil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       82200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          82000;
        startFace       82410;
    }
)

// ************************************************************************* //
