run/blockMesh_Test_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
																
scale	1	;														
                                                                
geometry																
{																
}	

vertices	
(
	(0    0   0) //0
	(1    0.0018899999999999666 0) //1
	(1    1   0) //2
	(-1.5 0   0) //3
	(2    0.0018899999999999666 0) //4
	(2    1   0) //5
	(1   -0.0018899999999999666 0) //6
	(2   -0.0018899999999999666 0) //7
	(1   -1   0) //8
	(2   -1   0) //9
	(0    0   1) //10
	(1    0.0018899999999999666 1) //11
	(1    1   1) //12
	(-1.5 0   1) //13
	(2    0.0018899999999999666 1) //14
	(2    1   1) //15
	(1   -0.0018899999999999666 1) //16
	(2   -0.0018899999999999666 1) //17
	(1   -1   1) //18
	(2   -1   1) //19
);
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 100 100 1) simpleGrading (1 1 1) //block	1
														
																
	hex	(1 4 5 2 11 14 15 12)	( 100 100 1) simpleGrading (1 1 1) //block	2	
															
               											
	hex	(6 7 4 1 16 17 14 11)	( 100 10 1) simpleGrading (1 1 1) //block	3
															
																												
	hex	(8 9 7 6 18 19 17 16)	( 100 100 1) simpleGrading (1 1 1) //block	4	
	
	hex	(3 8 6 0 13 18 16 10)	( 100 100 1) simpleGrading (1 1 1) //block	5
														
);		

edges																
(																
	arc	2 3	(-0.75 0.75 0)									
	arc	12 13	(-0.75 0.75 1)
	arc	8 3	(-0.75 -0.75 0)									
	arc	18 13	(-0.75 -0.75 1)
	
	spline	0 1													
(					      

  ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.004169154968825117 0 ) 
  ( 0.0009866357836101902 0.008281076632907582 0 ) 
  ( 0.0022190176933925554 0.012334122703810159 0 ) 
   ( 0.003942649333762649 0.016326255032679104 0 ) 
   ( 0.006155829688391956 0.020255052161571765 0 ) 
     ( 0.008856374615475837 0.0241177265817687 0 ) 
   ( 0.012041619003218151 0.027911146491242964 0 ) 
    ( 0.015708419399974638 0.03163186178898549 0 ) 
      ( 0.01985315711646002 0.0352761339929874 0 ) 
     ( 0.02447174179695788 0.03883996972203194 0 ) 
    ( 0.029559615456007327 0.04231915733968087 0 ) 
      ( 0.03511175697658486 0.0457093063225081 0 ) 
    ( 0.04112268706534028 0.049005888884203236 0 ) 
    ( 0.047586473659998074 0.05220428336303862 0 ) 
     ( 0.05449673778358616 0.05529981886265408 0 ) 
     ( 0.06184665983971649 0.05828782062537523 0 ) 
     ( 0.06962898634270315 0.06116365561344123 0 ) 
     ( 0.07783603707587677 0.06392277777658992 0 ) 
     ( 0.08645971267103159 0.06656077249433519 0 ) 
      ( 0.0954915026015235 0.06907339969778574 0 ) 
     ( 0.10492249358113281 0.07145663519871454 0 ) 
     ( 0.11474337836040116 0.07370670978242103 0 ) 
     ( 0.12494446491176331 0.07582014565527825 0 ) 
      ( 0.13551568599440833 0.0777937898771951 0 ) 
      ( 0.1464466090894303 0.07962484445295025 0 ) 
      ( 0.1577264466954656 0.08131089280381026 0 ) 
     ( 0.16934406697465365 0.08284992239132666 0 ) 
     ( 0.18128800473841744 0.08424034331796793 0 ) 
      ( 0.1935464727622202 0.08548100278351592 0 ) 
     ( 0.20610737341813284 0.08657119533115332 0 ) 
     ( 0.21895831061373222 0.08751066887210364 0 ) 
      ( 0.2320866020255476 0.08829962653177476 0 ) 
     ( 0.24547929161498316 0.08893872441284553 0 ) 
      ( 0.2591231624143632 0.08942906542088988 0 ) 
       ( 0.273004749570484 0.08977218934526894 0 ) 
       ( 0.287110353632798 0.08997005943150732 0 ) 
     ( 0.30142605407311807 0.09002504572062502 0 ) 
       ( 0.315937723023497 0.08993990546542407 0 ) 
      ( 0.3306310392187286 0.08971776096309535 0 ) 
       ( 0.345491502129707 0.08936207516737298 0 ) 
      ( 0.3605044462736979 0.08887662546156153 0 ) 
      ( 0.3756550556873999 0.08826547598592209 0 ) 
      ( 0.3909283785485107 0.08753294891905451 0 ) 
     ( 0.40630934193137186 0.08668359511306048 0 ) 
      ( 0.4217827666821252 0.08572216447652817 0 ) 
     ( 0.43733338239870584 0.08465357648792954 0 ) 
      ( 0.4529458425008854 0.08348289120514711 0 ) 
       ( 0.468604739375493 0.08221528111490378 0 ) 
      ( 0.4842946195818704 0.08085600413928488 0 ) 
      ( 0.4999999991025516 0.07941037808581562 0 ) 
      ( 0.5157053786241185 0.07788375679323846 0 ) 
      ( 0.5313952588331522 0.07628150818782539 0 ) 
       ( 0.5470541557121839 0.0746089944254042 0 ) 
      ( 0.5626666158205507 0.07287155425293544 0 ) 
      ( 0.5782172315450762 0.07107448768113994 0 ) 
       ( 0.593690656305524 0.06922304301703444 0 ) 
       ( 0.6090716196998196 0.0673224062629689 0 ) 
      ( 0.6243449425740935 0.06537769284755394 0 ) 
       ( 0.6394955520026742 0.0633939416143527 0 ) 
     ( 0.6545084961632448 0.061376110957014195 0 ) 
      ( 0.6693689590924875 0.05932907695519407 0 ) 
     ( 0.6840622753076503 0.057257633334668184 0 ) 
     ( 0.6985739442796073 0.055166493047932835 0 ) 
     ( 0.7128896447431308 0.053060291248693305 0 ) 
      ( 0.7269952488302514 0.05094358941527154 0 ) 
      ( 0.7408768360127569 0.04882088036434985 0 ) 
      ( 0.7545207068400739 0.04669659388775366 0 ) 
     ( 0.7679133964589709 0.044575102741236876 0 ) 
     ( 0.7810416879017434 0.042460728715449876 0 ) 
      ( 0.7938926251297652 0.04035774852534163 0 ) 
       ( 0.8064535258195331 0.0382703992650045 0 ) 
      ( 0.8187119938785907 0.03620288319015597 0 ) 
      ( 0.8306559316789744 0.03415937160974301 0 ) 
     ( 0.8422735519961111 0.032144007691162185 0 ) 
      ( 0.853553389641386 0.030160908009871888 0 ) 
       ( 0.8644843127769004 0.0282141627032232 0 ) 
      ( 0.8750555339012502 0.02630783411962693 0 ) 
     ( 0.8852566204954886 0.024445953887123652 0 ) 
      ( 0.8950775053187623 0.02263251835944655 0 ) 
     ( 0.9045084963434626 0.020871482432147093 0 ) 
     ( 0.9135402863200868 0.019166751755690246 0 ) 
     ( 0.9221639619623694 0.017522173406010533 0 ) 
     ( 0.9303710127436202 0.015941525105270856 0 ) 
     ( 0.9381533392955854 0.014428503115926528 0 ) 
     ( 0.9455032614015477 0.012986708959144007 0 ) 
     ( 0.9524135255757721 0.011619635133683175 0 ) 
     ( 0.9588773122218202 0.010330650033101135 0 ) 
     ( 0.9648882423626697 0.009122982277207954 0 ) 
      ( 0.9704403839359932 0.00799970468780559 0 ) 
     ( 0.9755282576483886 0.006963718148641131 0 ) 
     ( 0.9801468423827797 0.006017735595046237 0 ) 
     ( 0.9842915801536527 0.005164266379846163 0 ) 
     ( 0.9879583806052372 0.004405601258790136 0 ) 
     ( 0.9911436250481941 0.003743798231068984 0 ) 
    ( 0.9938441700308243 0.0031806694585819065 0 ) 
    ( 0.9960573504412771 0.0027177694717267493 0 ) 
    ( 0.9977809821376927 0.0023563848499015562 0 ) 
    ( 0.9990133641036874 0.0020975255419717394 0 ) 
    ( 0.9997532801270506 0.0019419179661001593 0 ) 
                   ( 1.0 0.0018899999999999666 0 )  
  )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.004169154968825117 1 ) 
  ( 0.0009866357836101902 0.008281076632907582 1 ) 
  ( 0.0022190176933925554 0.012334122703810159 1 ) 
   ( 0.003942649333762649 0.016326255032679104 1 ) 
   ( 0.006155829688391956 0.020255052161571765 1 ) 
     ( 0.008856374615475837 0.0241177265817687 1 ) 
   ( 0.012041619003218151 0.027911146491242964 1 ) 
    ( 0.015708419399974638 0.03163186178898549 1 ) 
      ( 0.01985315711646002 0.0352761339929874 1 ) 
     ( 0.02447174179695788 0.03883996972203194 1 ) 
    ( 0.029559615456007327 0.04231915733968087 1 ) 
      ( 0.03511175697658486 0.0457093063225081 1 ) 
    ( 0.04112268706534028 0.049005888884203236 1 ) 
    ( 0.047586473659998074 0.05220428336303862 1 ) 
     ( 0.05449673778358616 0.05529981886265408 1 ) 
     ( 0.06184665983971649 0.05828782062537523 1 ) 
     ( 0.06962898634270315 0.06116365561344123 1 ) 
     ( 0.07783603707587677 0.06392277777658992 1 ) 
     ( 0.08645971267103159 0.06656077249433519 1 ) 
      ( 0.0954915026015235 0.06907339969778574 1 ) 
     ( 0.10492249358113281 0.07145663519871454 1 ) 
     ( 0.11474337836040116 0.07370670978242103 1 ) 
     ( 0.12494446491176331 0.07582014565527825 1 ) 
      ( 0.13551568599440833 0.0777937898771951 1 ) 
      ( 0.1464466090894303 0.07962484445295025 1 ) 
      ( 0.1577264466954656 0.08131089280381026 1 ) 
     ( 0.16934406697465365 0.08284992239132666 1 ) 
     ( 0.18128800473841744 0.08424034331796793 1 ) 
      ( 0.1935464727622202 0.08548100278351592 1 ) 
     ( 0.20610737341813284 0.08657119533115332 1 ) 
     ( 0.21895831061373222 0.08751066887210364 1 ) 
      ( 0.2320866020255476 0.08829962653177476 1 ) 
     ( 0.24547929161498316 0.08893872441284553 1 ) 
      ( 0.2591231624143632 0.08942906542088988 1 ) 
       ( 0.273004749570484 0.08977218934526894 1 ) 
       ( 0.287110353632798 0.08997005943150732 1 ) 
     ( 0.30142605407311807 0.09002504572062502 1 ) 
       ( 0.315937723023497 0.08993990546542407 1 ) 
      ( 0.3306310392187286 0.08971776096309535 1 ) 
       ( 0.345491502129707 0.08936207516737298 1 ) 
      ( 0.3605044462736979 0.08887662546156153 1 ) 
      ( 0.3756550556873999 0.08826547598592209 1 ) 
      ( 0.3909283785485107 0.08753294891905451 1 ) 
     ( 0.40630934193137186 0.08668359511306048 1 ) 
      ( 0.4217827666821252 0.08572216447652817 1 ) 
     ( 0.43733338239870584 0.08465357648792954 1 ) 
      ( 0.4529458425008854 0.08348289120514711 1 ) 
       ( 0.468604739375493 0.08221528111490378 1 ) 
      ( 0.4842946195818704 0.08085600413928488 1 ) 
      ( 0.4999999991025516 0.07941037808581562 1 ) 
      ( 0.5157053786241185 0.07788375679323846 1 ) 
      ( 0.5313952588331522 0.07628150818782539 1 ) 
       ( 0.5470541557121839 0.0746089944254042 1 ) 
      ( 0.5626666158205507 0.07287155425293544 1 ) 
      ( 0.5782172315450762 0.07107448768113994 1 ) 
       ( 0.593690656305524 0.06922304301703444 1 ) 
       ( 0.6090716196998196 0.0673224062629689 1 ) 
      ( 0.6243449425740935 0.06537769284755394 1 ) 
       ( 0.6394955520026742 0.0633939416143527 1 ) 
     ( 0.6545084961632448 0.061376110957014195 1 ) 
      ( 0.6693689590924875 0.05932907695519407 1 ) 
     ( 0.6840622753076503 0.057257633334668184 1 ) 
     ( 0.6985739442796073 0.055166493047932835 1 ) 
     ( 0.7128896447431308 0.053060291248693305 1 ) 
      ( 0.7269952488302514 0.05094358941527154 1 ) 
      ( 0.7408768360127569 0.04882088036434985 1 ) 
      ( 0.7545207068400739 0.04669659388775366 1 ) 
     ( 0.7679133964589709 0.044575102741236876 1 ) 
     ( 0.7810416879017434 0.042460728715449876 1 ) 
      ( 0.7938926251297652 0.04035774852534163 1 ) 
       ( 0.8064535258195331 0.0382703992650045 1 ) 
      ( 0.8187119938785907 0.03620288319015597 1 ) 
      ( 0.8306559316789744 0.03415937160974301 1 ) 
     ( 0.8422735519961111 0.032144007691162185 1 ) 
      ( 0.853553389641386 0.030160908009871888 1 ) 
       ( 0.8644843127769004 0.0282141627032232 1 ) 
      ( 0.8750555339012502 0.02630783411962693 1 ) 
     ( 0.8852566204954886 0.024445953887123652 1 ) 
      ( 0.8950775053187623 0.02263251835944655 1 ) 
     ( 0.9045084963434626 0.020871482432147093 1 ) 
     ( 0.9135402863200868 0.019166751755690246 1 ) 
     ( 0.9221639619623694 0.017522173406010533 1 ) 
     ( 0.9303710127436202 0.015941525105270856 1 ) 
     ( 0.9381533392955854 0.014428503115926528 1 ) 
     ( 0.9455032614015477 0.012986708959144007 1 ) 
     ( 0.9524135255757721 0.011619635133683175 1 ) 
     ( 0.9588773122218202 0.010330650033101135 1 ) 
     ( 0.9648882423626697 0.009122982277207954 1 ) 
      ( 0.9704403839359932 0.00799970468780559 1 ) 
     ( 0.9755282576483886 0.006963718148641131 1 ) 
     ( 0.9801468423827797 0.006017735595046237 1 ) 
     ( 0.9842915801536527 0.005164266379846163 1 ) 
     ( 0.9879583806052372 0.004405601258790136 1 ) 
     ( 0.9911436250481941 0.003743798231068984 1 ) 
    ( 0.9938441700308243 0.0031806694585819065 1 ) 
    ( 0.9960573504412771 0.0027177694717267493 1 ) 
    ( 0.9977809821376927 0.0023563848499015562 1 ) 
    ( 0.9990133641036874 0.0020975255419717394 1 ) 
    ( 0.9997532801270506 0.0019419179661001593 1 ) 
                   ( 1.0 0.0018899999999999666 1 )  
	)
	
spline	0 6		
(				
				
(	0.00024671981657	-0.004169154968825	0	)
(	0.00098663578361	-0.008281076632908	0	)
(	0.002219017693393	-0.01233412270381	0	)
(	0.003942649333763	-0.016326255032679	0	)
(	0.006155829688392	-0.020255052161572	0	)
(	0.008856374615476	-0.024117726581769	0	)
(	0.012041619003218	-0.027911146491243	0	)
(	0.015708419399975	-0.031631861788986	0	)
(	0.01985315711646	-0.035276133992987	0	)
(	0.024471741796958	-0.038839969722032	0	)
(	0.029559615456007	-0.042319157339681	0	)
(	0.035111756976585	-0.045709306322508	0	)
(	0.04112268706534	-0.049005888884203	0	)
(	0.047586473659998	-0.052204283363039	0	)
(	0.054496737783586	-0.055299818862654	0	)
(	0.061846659839717	-0.058287820625375	0	)
(	0.069628986342703	-0.061163655613441	0	)
(	0.077836037075877	-0.06392277777659	0	)
(	0.086459712671032	-0.066560772494335	0	)
(	0.095491502601524	-0.069073399697786	0	)
(	0.104922493581133	-0.071456635198715	0	)
(	0.114743378360401	-0.073706709782421	0	)
(	0.124944464911763	-0.075820145655278	0	)
(	0.135515685994408	-0.077793789877195	0	)
(	0.14644660908943	-0.07962484445295	0	)
(	0.157726446695466	-0.08131089280381	0	)
(	0.169344066974654	-0.082849922391327	0	)
(	0.181288004738417	-0.084240343317968	0	)
(	0.19354647276222	-0.085481002783516	0	)
(	0.206107373418133	-0.086571195331153	0	)
(	0.218958310613732	-0.087510668872104	0	)
(	0.232086602025548	-0.088299626531775	0	)
(	0.245479291614983	-0.088938724412846	0	)
(	0.259123162414363	-0.08942906542089	0	)
(	0.273004749570484	-0.089772189345269	0	)
(	0.287110353632798	-0.089970059431507	0	)
(	0.301426054073118	-0.090025045720625	0	)
(	0.315937723023497	-0.089939905465424	0	)
(	0.330631039218729	-0.089717760963095	0	)
(	0.345491502129707	-0.089362075167373	0	)
(	0.360504446273698	-0.088876625461562	0	)
(	0.3756550556874	-0.088265475985922	0	)
(	0.390928378548511	-0.087532948919055	0	)
(	0.406309341931372	-0.086683595113061	0	)
(	0.421782766682125	-0.085722164476528	0	)
(	0.437333382398706	-0.08465357648793	0	)
(	0.452945842500885	-0.083482891205147	0	)
(	0.468604739375493	-0.082215281114904	0	)
(	0.48429461958187	-0.080856004139285	0	)
(	0.499999999102552	-0.079410378085816	0	)
(	0.515705378624118	-0.077883756793239	0	)
(	0.531395258833152	-0.076281508187825	0	)
(	0.547054155712184	-0.074608994425404	0	)
(	0.562666615820551	-0.072871554252936	0	)
(	0.578217231545076	-0.07107448768114	0	)
(	0.593690656305524	-0.069223043017035	0	)
(	0.60907161969982	-0.067322406262969	0	)
(	0.624344942574093	-0.065377692847554	0	)
(	0.639495552002674	-0.063393941614353	0	)
(	0.654508496163245	-0.061376110957014	0	)
(	0.669368959092487	-0.059329076955194	0	)
(	0.68406227530765	-0.057257633334668	0	)
(	0.698573944279607	-0.055166493047933	0	)
(	0.712889644743131	-0.053060291248693	0	)
(	0.726995248830251	-0.050943589415272	0	)
(	0.740876836012757	-0.04882088036435	0	)
(	0.754520706840074	-0.046696593887754	0	)
(	0.767913396458971	-0.044575102741237	0	)
(	0.793892625129765	-0.040357748525342	0	)
(	0.806453525819533	-0.038270399265005	0	)
(	0.818711993878591	-0.036202883190156	0	)
(	0.830655931678974	-0.034159371609743	0	)
(	0.842273551996111	-0.032144007691162	0	)
(	0.853553389641386	-0.030160908009872	0	)
(	0.8644843127769	-0.028214162703223	0	)
(	0.87505553390125	-0.026307834119627	0	)
(	0.885256620495488	-0.024445953887124	0	)
(	0.895077505318762	-0.022632518359447	0	)
(	0.904508496343463	-0.020871482432147	0	)
(	0.913540286320087	-0.01916675175569	0	)
(	0.922163961962369	-0.017522173406011	0	)
(	0.93037101274362	-0.015941525105271	0	)
(	0.938153339295585	-0.014428503115927	0	)
(	0.945503261401548	-0.012986708959144	0	)
(	0.952413525575772	-0.011619635133683	0	)
(	0.95887731222182	-0.010330650033101	0	)
(	0.96488824236267	-0.009122982277208	0	)
(	0.970440383935993	-0.007999704687806	0	)
(	0.975528257648389	-0.006963718148641	0	)
(	0.98014684238278	-0.006017735595046	0	)
(	0.984291580153653	-0.005164266379846	0	)
(	0.987958380605237	-0.00440560125879	0	)
(	0.991143625048194	-0.003743798231069	0	)
(	0.993844170030824	-0.003180669458582	0	)
(	0.996057350441277	-0.002717769471727	0	)
(	0.997780982137693	-0.002356384849902	0	)
(	0.999013364103687	-0.002097525541972	0	)
(	0.999753280127051	-0.0019419179661	0	)
				)          
	
		
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.004169154968825117 1 ) 
  ( 0.0009866357836101902 -0.008281076632907582 1 ) 
  ( 0.0022190176933925554 -0.012334122703810159 1 ) 
   ( 0.003942649333762649 -0.016326255032679104 1 ) 
   ( 0.006155829688391956 -0.020255052161571765 1 ) 
     ( 0.008856374615475837 -0.0241177265817687 1 ) 
   ( 0.012041619003218151 -0.027911146491242964 1 ) 
    ( 0.015708419399974638 -0.03163186178898549 1 ) 
      ( 0.01985315711646002 -0.0352761339929874 1 ) 
     ( 0.02447174179695788 -0.03883996972203194 1 ) 
    ( 0.029559615456007327 -0.04231915733968087 1 ) 
      ( 0.03511175697658486 -0.0457093063225081 1 ) 
    ( 0.04112268706534028 -0.049005888884203236 1 ) 
    ( 0.047586473659998074 -0.05220428336303862 1 ) 
     ( 0.05449673778358616 -0.05529981886265408 1 ) 
     ( 0.06184665983971649 -0.05828782062537523 1 ) 
     ( 0.06962898634270315 -0.06116365561344123 1 ) 
     ( 0.07783603707587677 -0.06392277777658992 1 ) 
     ( 0.08645971267103159 -0.06656077249433519 1 ) 
      ( 0.0954915026015235 -0.06907339969778574 1 ) 
     ( 0.10492249358113281 -0.07145663519871454 1 ) 
     ( 0.11474337836040116 -0.07370670978242103 1 ) 
     ( 0.12494446491176331 -0.07582014565527825 1 ) 
      ( 0.13551568599440833 -0.0777937898771951 1 ) 
      ( 0.1464466090894303 -0.07962484445295025 1 ) 
      ( 0.1577264466954656 -0.08131089280381026 1 ) 
     ( 0.16934406697465365 -0.08284992239132666 1 ) 
     ( 0.18128800473841744 -0.08424034331796793 1 ) 
      ( 0.1935464727622202 -0.08548100278351592 1 ) 
     ( 0.20610737341813284 -0.08657119533115332 1 ) 
     ( 0.21895831061373222 -0.08751066887210364 1 ) 
      ( 0.2320866020255476 -0.08829962653177476 1 ) 
     ( 0.24547929161498316 -0.08893872441284553 1 ) 
      ( 0.2591231624143632 -0.08942906542088988 1 ) 
       ( 0.273004749570484 -0.08977218934526894 1 ) 
       ( 0.287110353632798 -0.08997005943150732 1 ) 
     ( 0.30142605407311807 -0.09002504572062502 1 ) 
       ( 0.315937723023497 -0.08993990546542407 1 ) 
      ( 0.3306310392187286 -0.08971776096309535 1 ) 
       ( 0.345491502129707 -0.08936207516737298 1 ) 
      ( 0.3605044462736979 -0.08887662546156153 1 ) 
      ( 0.3756550556873999 -0.08826547598592209 1 ) 
      ( 0.3909283785485107 -0.08753294891905451 1 ) 
     ( 0.40630934193137186 -0.08668359511306048 1 ) 
      ( 0.4217827666821252 -0.08572216447652817 1 ) 
     ( 0.43733338239870584 -0.08465357648792954 1 ) 
      ( 0.4529458425008854 -0.08348289120514711 1 ) 
       ( 0.468604739375493 -0.08221528111490378 1 ) 
      ( 0.4842946195818704 -0.08085600413928488 1 ) 
      ( 0.4999999991025516 -0.07941037808581562 1 ) 
      ( 0.5157053786241185 -0.07788375679323846 1 ) 
      ( 0.5313952588331522 -0.07628150818782539 1 ) 
       ( 0.5470541557121839 -0.0746089944254042 1 ) 
      ( 0.5626666158205507 -0.07287155425293544 1 ) 
      ( 0.5782172315450762 -0.07107448768113994 1 ) 
       ( 0.593690656305524 -0.06922304301703444 1 ) 
       ( 0.6090716196998196 -0.0673224062629689 1 ) 
      ( 0.6243449425740935 -0.06537769284755394 1 ) 
       ( 0.6394955520026742 -0.0633939416143527 1 ) 
     ( 0.6545084961632448 -0.061376110957014195 1 ) 
      ( 0.6693689590924875 -0.05932907695519407 1 ) 
     ( 0.6840622753076503 -0.057257633334668184 1 ) 
     ( 0.6985739442796073 -0.055166493047932835 1 ) 
     ( 0.7128896447431308 -0.053060291248693305 1 ) 
      ( 0.7269952488302514 -0.05094358941527154 1 ) 
      ( 0.7408768360127569 -0.04882088036434985 1 ) 
      ( 0.7545207068400739 -0.04669659388775366 1 ) 
     ( 0.7679133964589709 -0.044575102741236876 1 ) 
     ( 0.7810416879017434 -0.042460728715449876 1 ) 
      ( 0.7938926251297652 -0.04035774852534163 1 ) 
       ( 0.8064535258195331 -0.0382703992650045 1 ) 
      ( 0.8187119938785907 -0.03620288319015597 1 ) 
      ( 0.8306559316789744 -0.03415937160974301 1 ) 
     ( 0.8422735519961111 -0.032144007691162185 1 ) 
      ( 0.853553389641386 -0.030160908009871888 1 ) 
       ( 0.8644843127769004 -0.0282141627032232 1 ) 
      ( 0.8750555339012502 -0.02630783411962693 1 ) 
     ( 0.8852566204954886 -0.024445953887123652 1 ) 
      ( 0.8950775053187623 -0.02263251835944655 1 ) 
     ( 0.9045084963434626 -0.020871482432147093 1 ) 
     ( 0.9135402863200868 -0.019166751755690246 1 ) 
     ( 0.9221639619623694 -0.017522173406010533 1 ) 
     ( 0.9303710127436202 -0.015941525105270856 1 ) 
     ( 0.9381533392955854 -0.014428503115926528 1 ) 
     ( 0.9455032614015477 -0.012986708959144007 1 ) 
     ( 0.9524135255757721 -0.011619635133683175 1 ) 
     ( 0.9588773122218202 -0.010330650033101135 1 ) 
     ( 0.9648882423626697 -0.009122982277207954 1 ) 
      ( 0.9704403839359932 -0.00799970468780559 1 ) 
     ( 0.9755282576483886 -0.006963718148641131 1 ) 
     ( 0.9801468423827797 -0.006017735595046237 1 ) 
     ( 0.9842915801536527 -0.005164266379846163 1 ) 
     ( 0.9879583806052372 -0.004405601258790136 1 ) 
     ( 0.9911436250481941 -0.003743798231068984 1 ) 
    ( 0.9938441700308243 -0.0031806694585819065 1 ) 
    ( 0.9960573504412771 -0.0027177694717267493 1 ) 
    ( 0.9977809821376927 -0.0023563848499015562 1 ) 
    ( 0.9990133641036874 -0.0020975255419717394 1 ) 
    ( 0.9997532801270506 -0.0019419179661001593 1 ) 
                   ( 1.0 -0.0018899999999999666 1 )  
							
        )										
	
);
								
                                                            
faces																
(																
                                                            
);																
                                                            
faces																
(																
                                                            
);																
                                                                                                                     
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}		
                                                            																
boundary																
(																
	inlet              																
	    {																
		type patch;    																
		faces																
		(																
			(3 13 12 2)
			(8 18 13 3)
			(5 2 12 15)
		    	(8 9 19 18)															
		);																
	    } 
	outlet              																
	    {																
		type patch;    																
		faces																
		(																
		    (4 5 15 14)
		    (7 4 14 17)
		    (7 17 19 9)  															
		);																
	    }	

	foil              																
	    {																
		type wall;    																
		faces																
		(																
		    (0 1 11 10)
		    (0 6 16 10)
		    (6 1 11 16)															
		);																
	    }	
	   														
                                                            		
);	
// ************************************************************************* //	
