run/blockMesh_Test_1/system/blockMeshDict_simplified_working
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
																
scale	1	;														
                                                                
geometry																
{																
}	

vertices	
(
	(0    0   0) //0
	(1    0.1 0) //1
	(1    1   0) //2
	(-1.5 0   0) //3
	(2    0.1 0) //4
	(2    1   0) //5
	(1   -0.1 0) //6
	(2   -0.1 0) //7
	(1   -1   0) //8
	(2   -1   0) //9
	(0    0   1) //10
	(1    0.1 1) //11
	(1    1   1) //12
	(-1.5 0   1) //13
	(2    0.1 1) //14
	(2    1   1) //15
	(1   -0.1 1) //16
	(2   -0.1 1) //17
	(1   -1   1) //18
	(2   -1   1) //19
);
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 10 10 10) simpleGrading (1 1 1) //block	1
														
																
	hex	(1 4 5 2 11 14 15 12)	( 10 10 10) simpleGrading (1 1 1) //block	2	
															
               											
	hex	(6 7 4 1 16 17 14 11)	( 10 10 10) simpleGrading (1 1 1) //block	3
															
																												
	hex	(8 9 7 6 18 19 17 16)	( 10 10 10) simpleGrading (1 1 1) //block	4	
	
	hex	(3 8 6 0 13 18 16 10)	( 10 10 10) simpleGrading (1 1 1) //block	5
														
);		

edges																
(																

);
								
                                                            
faces																
(																
                                                            
);																
                                                            
faces																
(																
                                                            
);																
                                                                                                                     
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}		
                                                            																
boundary																
(																
	inlet              																
	    {																
		type patch;    																
		faces																
		(																
			(3 13 12 2)
			(8 18 13 3)
			(5 2 12 15)
		    	(8 9 19 18)															
		);																
	    } 
	outlet              																
	    {																
		type patch;    																
		faces																
		(																
		    (4 5 15 14)
		    (7 4 14 17)
		    (7 17 19 9)  															
		);																
	    }	

	foil              																
	    {																
		type wall;    																
		faces																
		(																
		    (0 1 11 10)
		    (0 6 16 10)
		    (6 1 11 16)															
		);																
	    }	
	   														
                                                            		
);	
// ************************************************************************* //	
