run/blockMesh_Test_1/system/blockMeshDict_try
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
																
scale	1	;														
                                                                
geometry																
{																
}	

vertices	
(
               															
	                    (0.0 0.0 0 ) // 0
  (1.0 0.0018899999999999666 0 ) // 1
                     (1.0 10 0 ) //2 
                    (-10 0.0 0 ) // 3
                    (0.0 0.0 1 ) // 4
  (1.0 0.0018899999999999666 1 ) // 5
                     (1.0 10 1 ) // 6
                    (-10 0.0 1 ) // 7
   (15 0.0018899999999999666 0 ) // 8
                      (15 10 0 ) // 9
  (15 0.0018899999999999666 1 ) // 10
                     (15 10 1 ) // 11
                   (1.0 -10 0 ) // 12
                   (1.0 -10 1 ) // 13
                    (15 -10 0 ) // 14
                    (15 -10 1 ) // 15
(1.0 -0.0018899999999999666 0 ) // 16
 (1.0 -0.0018899999999999666 1) // 17
 (15 -0.0018899999999999666 0 ) // 18
(15 -0.0018899999999999666 1 ) // 19 
);
        
blocks																
(																
	hex	(0 1	2	3	4	5	6	7)	( 10 10 10) simpleGrading (1 1 1) //block	1
														
																
	hex	(1 8	9	2	5	10	11	6)	( 10 10 10) simpleGrading (1 1 1) //block	2	
															
               											
	hex	(3 12	16	0	7	13	17	4)	( 10 10 10) simpleGrading (1 1 1) //block	3
															
																												
	hex	(12 14	18	16	13	15	19	17)	( 10 10 10) simpleGrading (1 1 1) //block	4	
	
	hex	(16 18 8 1 13 15 19 17)				( 10 10 10) simpleGrading (1 1 1) //block	5
														
);		

edges																
(																
	arc	3 2	(	-7.48528137423857	8.48528137423857	0	)									
	arc	7 6 	(	-7.48528137423857	8.48528137423857	1	) 									
																
	spline	0 1													
	(					      

  ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.004169154968825117 0 ) 
  ( 0.0009866357836101902 0.008281076632907582 0 ) 
  ( 0.0022190176933925554 0.012334122703810159 0 ) 
   ( 0.003942649333762649 0.016326255032679104 0 ) 
   ( 0.006155829688391956 0.020255052161571765 0 ) 
     ( 0.008856374615475837 0.0241177265817687 0 ) 
   ( 0.012041619003218151 0.027911146491242964 0 ) 
    ( 0.015708419399974638 0.03163186178898549 0 ) 
      ( 0.01985315711646002 0.0352761339929874 0 ) 
     ( 0.02447174179695788 0.03883996972203194 0 ) 
    ( 0.029559615456007327 0.04231915733968087 0 ) 
      ( 0.03511175697658486 0.0457093063225081 0 ) 
    ( 0.04112268706534028 0.049005888884203236 0 ) 
    ( 0.047586473659998074 0.05220428336303862 0 ) 
     ( 0.05449673778358616 0.05529981886265408 0 ) 
     ( 0.06184665983971649 0.05828782062537523 0 ) 
     ( 0.06962898634270315 0.06116365561344123 0 ) 
     ( 0.07783603707587677 0.06392277777658992 0 ) 
     ( 0.08645971267103159 0.06656077249433519 0 ) 
      ( 0.0954915026015235 0.06907339969778574 0 ) 
     ( 0.10492249358113281 0.07145663519871454 0 ) 
     ( 0.11474337836040116 0.07370670978242103 0 ) 
     ( 0.12494446491176331 0.07582014565527825 0 ) 
      ( 0.13551568599440833 0.0777937898771951 0 ) 
      ( 0.1464466090894303 0.07962484445295025 0 ) 
      ( 0.1577264466954656 0.08131089280381026 0 ) 
     ( 0.16934406697465365 0.08284992239132666 0 ) 
     ( 0.18128800473841744 0.08424034331796793 0 ) 
      ( 0.1935464727622202 0.08548100278351592 0 ) 
     ( 0.20610737341813284 0.08657119533115332 0 ) 
     ( 0.21895831061373222 0.08751066887210364 0 ) 
      ( 0.2320866020255476 0.08829962653177476 0 ) 
     ( 0.24547929161498316 0.08893872441284553 0 ) 
      ( 0.2591231624143632 0.08942906542088988 0 ) 
       ( 0.273004749570484 0.08977218934526894 0 ) 
       ( 0.287110353632798 0.08997005943150732 0 ) 
     ( 0.30142605407311807 0.09002504572062502 0 ) 
       ( 0.315937723023497 0.08993990546542407 0 ) 
      ( 0.3306310392187286 0.08971776096309535 0 ) 
       ( 0.345491502129707 0.08936207516737298 0 ) 
      ( 0.3605044462736979 0.08887662546156153 0 ) 
      ( 0.3756550556873999 0.08826547598592209 0 ) 
      ( 0.3909283785485107 0.08753294891905451 0 ) 
     ( 0.40630934193137186 0.08668359511306048 0 ) 
      ( 0.4217827666821252 0.08572216447652817 0 ) 
     ( 0.43733338239870584 0.08465357648792954 0 ) 
      ( 0.4529458425008854 0.08348289120514711 0 ) 
       ( 0.468604739375493 0.08221528111490378 0 ) 
      ( 0.4842946195818704 0.08085600413928488 0 ) 
      ( 0.4999999991025516 0.07941037808581562 0 ) 
      ( 0.5157053786241185 0.07788375679323846 0 ) 
      ( 0.5313952588331522 0.07628150818782539 0 ) 
       ( 0.5470541557121839 0.0746089944254042 0 ) 
      ( 0.5626666158205507 0.07287155425293544 0 ) 
      ( 0.5782172315450762 0.07107448768113994 0 ) 
       ( 0.593690656305524 0.06922304301703444 0 ) 
       ( 0.6090716196998196 0.0673224062629689 0 ) 
      ( 0.6243449425740935 0.06537769284755394 0 ) 
       ( 0.6394955520026742 0.0633939416143527 0 ) 
     ( 0.6545084961632448 0.061376110957014195 0 ) 
      ( 0.6693689590924875 0.05932907695519407 0 ) 
     ( 0.6840622753076503 0.057257633334668184 0 ) 
     ( 0.6985739442796073 0.055166493047932835 0 ) 
     ( 0.7128896447431308 0.053060291248693305 0 ) 
      ( 0.7269952488302514 0.05094358941527154 0 ) 
      ( 0.7408768360127569 0.04882088036434985 0 ) 
      ( 0.7545207068400739 0.04669659388775366 0 ) 
     ( 0.7679133964589709 0.044575102741236876 0 ) 
     ( 0.7810416879017434 0.042460728715449876 0 ) 
      ( 0.7938926251297652 0.04035774852534163 0 ) 
       ( 0.8064535258195331 0.0382703992650045 0 ) 
      ( 0.8187119938785907 0.03620288319015597 0 ) 
      ( 0.8306559316789744 0.03415937160974301 0 ) 
     ( 0.8422735519961111 0.032144007691162185 0 ) 
      ( 0.853553389641386 0.030160908009871888 0 ) 
       ( 0.8644843127769004 0.0282141627032232 0 ) 
      ( 0.8750555339012502 0.02630783411962693 0 ) 
     ( 0.8852566204954886 0.024445953887123652 0 ) 
      ( 0.8950775053187623 0.02263251835944655 0 ) 
     ( 0.9045084963434626 0.020871482432147093 0 ) 
     ( 0.9135402863200868 0.019166751755690246 0 ) 
     ( 0.9221639619623694 0.017522173406010533 0 ) 
     ( 0.9303710127436202 0.015941525105270856 0 ) 
     ( 0.9381533392955854 0.014428503115926528 0 ) 
     ( 0.9455032614015477 0.012986708959144007 0 ) 
     ( 0.9524135255757721 0.011619635133683175 0 ) 
     ( 0.9588773122218202 0.010330650033101135 0 ) 
     ( 0.9648882423626697 0.009122982277207954 0 ) 
      ( 0.9704403839359932 0.00799970468780559 0 ) 
     ( 0.9755282576483886 0.006963718148641131 0 ) 
     ( 0.9801468423827797 0.006017735595046237 0 ) 
     ( 0.9842915801536527 0.005164266379846163 0 ) 
     ( 0.9879583806052372 0.004405601258790136 0 ) 
     ( 0.9911436250481941 0.003743798231068984 0 ) 
    ( 0.9938441700308243 0.0031806694585819065 0 ) 
    ( 0.9960573504412771 0.0027177694717267493 0 ) 
    ( 0.9977809821376927 0.0023563848499015562 0 ) 
    ( 0.9990133641036874 0.0020975255419717394 0 ) 
    ( 0.9997532801270506 0.0019419179661001593 0 ) 
                   ( 1.0 0.0018899999999999666 0 )  
  )
    spline 4 5
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.004169154968825117 1 ) 
  ( 0.0009866357836101902 0.008281076632907582 1 ) 
  ( 0.0022190176933925554 0.012334122703810159 1 ) 
   ( 0.003942649333762649 0.016326255032679104 1 ) 
   ( 0.006155829688391956 0.020255052161571765 1 ) 
     ( 0.008856374615475837 0.0241177265817687 1 ) 
   ( 0.012041619003218151 0.027911146491242964 1 ) 
    ( 0.015708419399974638 0.03163186178898549 1 ) 
      ( 0.01985315711646002 0.0352761339929874 1 ) 
     ( 0.02447174179695788 0.03883996972203194 1 ) 
    ( 0.029559615456007327 0.04231915733968087 1 ) 
      ( 0.03511175697658486 0.0457093063225081 1 ) 
    ( 0.04112268706534028 0.049005888884203236 1 ) 
    ( 0.047586473659998074 0.05220428336303862 1 ) 
     ( 0.05449673778358616 0.05529981886265408 1 ) 
     ( 0.06184665983971649 0.05828782062537523 1 ) 
     ( 0.06962898634270315 0.06116365561344123 1 ) 
     ( 0.07783603707587677 0.06392277777658992 1 ) 
     ( 0.08645971267103159 0.06656077249433519 1 ) 
      ( 0.0954915026015235 0.06907339969778574 1 ) 
     ( 0.10492249358113281 0.07145663519871454 1 ) 
     ( 0.11474337836040116 0.07370670978242103 1 ) 
     ( 0.12494446491176331 0.07582014565527825 1 ) 
      ( 0.13551568599440833 0.0777937898771951 1 ) 
      ( 0.1464466090894303 0.07962484445295025 1 ) 
      ( 0.1577264466954656 0.08131089280381026 1 ) 
     ( 0.16934406697465365 0.08284992239132666 1 ) 
     ( 0.18128800473841744 0.08424034331796793 1 ) 
      ( 0.1935464727622202 0.08548100278351592 1 ) 
     ( 0.20610737341813284 0.08657119533115332 1 ) 
     ( 0.21895831061373222 0.08751066887210364 1 ) 
      ( 0.2320866020255476 0.08829962653177476 1 ) 
     ( 0.24547929161498316 0.08893872441284553 1 ) 
      ( 0.2591231624143632 0.08942906542088988 1 ) 
       ( 0.273004749570484 0.08977218934526894 1 ) 
       ( 0.287110353632798 0.08997005943150732 1 ) 
     ( 0.30142605407311807 0.09002504572062502 1 ) 
       ( 0.315937723023497 0.08993990546542407 1 ) 
      ( 0.3306310392187286 0.08971776096309535 1 ) 
       ( 0.345491502129707 0.08936207516737298 1 ) 
      ( 0.3605044462736979 0.08887662546156153 1 ) 
      ( 0.3756550556873999 0.08826547598592209 1 ) 
      ( 0.3909283785485107 0.08753294891905451 1 ) 
     ( 0.40630934193137186 0.08668359511306048 1 ) 
      ( 0.4217827666821252 0.08572216447652817 1 ) 
     ( 0.43733338239870584 0.08465357648792954 1 ) 
      ( 0.4529458425008854 0.08348289120514711 1 ) 
       ( 0.468604739375493 0.08221528111490378 1 ) 
      ( 0.4842946195818704 0.08085600413928488 1 ) 
      ( 0.4999999991025516 0.07941037808581562 1 ) 
      ( 0.5157053786241185 0.07788375679323846 1 ) 
      ( 0.5313952588331522 0.07628150818782539 1 ) 
       ( 0.5470541557121839 0.0746089944254042 1 ) 
      ( 0.5626666158205507 0.07287155425293544 1 ) 
      ( 0.5782172315450762 0.07107448768113994 1 ) 
       ( 0.593690656305524 0.06922304301703444 1 ) 
       ( 0.6090716196998196 0.0673224062629689 1 ) 
      ( 0.6243449425740935 0.06537769284755394 1 ) 
       ( 0.6394955520026742 0.0633939416143527 1 ) 
     ( 0.6545084961632448 0.061376110957014195 1 ) 
      ( 0.6693689590924875 0.05932907695519407 1 ) 
     ( 0.6840622753076503 0.057257633334668184 1 ) 
     ( 0.6985739442796073 0.055166493047932835 1 ) 
     ( 0.7128896447431308 0.053060291248693305 1 ) 
      ( 0.7269952488302514 0.05094358941527154 1 ) 
      ( 0.7408768360127569 0.04882088036434985 1 ) 
      ( 0.7545207068400739 0.04669659388775366 1 ) 
     ( 0.7679133964589709 0.044575102741236876 1 ) 
     ( 0.7810416879017434 0.042460728715449876 1 ) 
      ( 0.7938926251297652 0.04035774852534163 1 ) 
       ( 0.8064535258195331 0.0382703992650045 1 ) 
      ( 0.8187119938785907 0.03620288319015597 1 ) 
      ( 0.8306559316789744 0.03415937160974301 1 ) 
     ( 0.8422735519961111 0.032144007691162185 1 ) 
      ( 0.853553389641386 0.030160908009871888 1 ) 
       ( 0.8644843127769004 0.0282141627032232 1 ) 
      ( 0.8750555339012502 0.02630783411962693 1 ) 
     ( 0.8852566204954886 0.024445953887123652 1 ) 
      ( 0.8950775053187623 0.02263251835944655 1 ) 
     ( 0.9045084963434626 0.020871482432147093 1 ) 
     ( 0.9135402863200868 0.019166751755690246 1 ) 
     ( 0.9221639619623694 0.017522173406010533 1 ) 
     ( 0.9303710127436202 0.015941525105270856 1 ) 
     ( 0.9381533392955854 0.014428503115926528 1 ) 
     ( 0.9455032614015477 0.012986708959144007 1 ) 
     ( 0.9524135255757721 0.011619635133683175 1 ) 
     ( 0.9588773122218202 0.010330650033101135 1 ) 
     ( 0.9648882423626697 0.009122982277207954 1 ) 
      ( 0.9704403839359932 0.00799970468780559 1 ) 
     ( 0.9755282576483886 0.006963718148641131 1 ) 
     ( 0.9801468423827797 0.006017735595046237 1 ) 
     ( 0.9842915801536527 0.005164266379846163 1 ) 
     ( 0.9879583806052372 0.004405601258790136 1 ) 
     ( 0.9911436250481941 0.003743798231068984 1 ) 
    ( 0.9938441700308243 0.0031806694585819065 1 ) 
    ( 0.9960573504412771 0.0027177694717267493 1 ) 
    ( 0.9977809821376927 0.0023563848499015562 1 ) 
    ( 0.9990133641036874 0.0020975255419717394 1 ) 
    ( 0.9997532801270506 0.0019419179661001593 1 ) 
                   ( 1.0 0.0018899999999999666 1 )  
	)															
																
																
	arc	3 12	(	-7.48528137423857	-8.48528137423857	0	)									
	arc	7 13	(	-7.48528137423857	-8.48528137423857	1	)									
																
	spline	0	16													
	(
                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.004169154968825117 0 ) 
  ( 0.0009866357836101902 0.008281076632907582 0 ) 
  ( 0.0022190176933925554 0.012334122703810159 0 ) 
   ( 0.003942649333762649 0.016326255032679104 0 ) 
   ( 0.006155829688391956 0.020255052161571765 0 ) 
     ( 0.008856374615475837 0.0241177265817687 0 ) 
   ( 0.012041619003218151 0.027911146491242964 0 ) 
    ( 0.015708419399974638 0.03163186178898549 0 ) 
      ( 0.01985315711646002 0.0352761339929874 0 ) 
     ( 0.02447174179695788 0.03883996972203194 0 ) 
    ( 0.029559615456007327 0.04231915733968087 0 ) 
      ( 0.03511175697658486 0.0457093063225081 0 ) 
    ( 0.04112268706534028 0.049005888884203236 0 ) 
    ( 0.047586473659998074 0.05220428336303862 0 ) 
     ( 0.05449673778358616 0.05529981886265408 0 ) 
     ( 0.06184665983971649 0.05828782062537523 0 ) 
     ( 0.06962898634270315 0.06116365561344123 0 ) 
     ( 0.07783603707587677 0.06392277777658992 0 ) 
     ( 0.08645971267103159 0.06656077249433519 0 ) 
      ( 0.0954915026015235 0.06907339969778574 0 ) 
     ( 0.10492249358113281 0.07145663519871454 0 ) 
     ( 0.11474337836040116 0.07370670978242103 0 ) 
     ( 0.12494446491176331 0.07582014565527825 0 ) 
      ( 0.13551568599440833 0.0777937898771951 0 ) 
      ( 0.1464466090894303 0.07962484445295025 0 ) 
      ( 0.1577264466954656 0.08131089280381026 0 ) 
     ( 0.16934406697465365 0.08284992239132666 0 ) 
     ( 0.18128800473841744 0.08424034331796793 0 ) 
      ( 0.1935464727622202 0.08548100278351592 0 ) 
     ( 0.20610737341813284 0.08657119533115332 0 ) 
     ( 0.21895831061373222 0.08751066887210364 0 ) 
      ( 0.2320866020255476 0.08829962653177476 0 ) 
     ( 0.24547929161498316 0.08893872441284553 0 ) 
      ( 0.2591231624143632 0.08942906542088988 0 ) 
       ( 0.273004749570484 0.08977218934526894 0 ) 
       ( 0.287110353632798 0.08997005943150732 0 ) 
     ( 0.30142605407311807 0.09002504572062502 0 ) 
       ( 0.315937723023497 0.08993990546542407 0 ) 
      ( 0.3306310392187286 0.08971776096309535 0 ) 
       ( 0.345491502129707 0.08936207516737298 0 ) 
      ( 0.3605044462736979 0.08887662546156153 0 ) 
      ( 0.3756550556873999 0.08826547598592209 0 ) 
      ( 0.3909283785485107 0.08753294891905451 0 ) 
     ( 0.40630934193137186 0.08668359511306048 0 ) 
      ( 0.4217827666821252 0.08572216447652817 0 ) 
     ( 0.43733338239870584 0.08465357648792954 0 ) 
      ( 0.4529458425008854 0.08348289120514711 0 ) 
       ( 0.468604739375493 0.08221528111490378 0 ) 
      ( 0.4842946195818704 0.08085600413928488 0 ) 
      ( 0.4999999991025516 0.07941037808581562 0 ) 
      ( 0.5157053786241185 0.07788375679323846 0 ) 
      ( 0.5313952588331522 0.07628150818782539 0 ) 
       ( 0.5470541557121839 0.0746089944254042 0 ) 
      ( 0.5626666158205507 0.07287155425293544 0 ) 
      ( 0.5782172315450762 0.07107448768113994 0 ) 
       ( 0.593690656305524 0.06922304301703444 0 ) 
       ( 0.6090716196998196 0.0673224062629689 0 ) 
      ( 0.6243449425740935 0.06537769284755394 0 ) 
       ( 0.6394955520026742 0.0633939416143527 0 ) 
     ( 0.6545084961632448 0.061376110957014195 0 ) 
      ( 0.6693689590924875 0.05932907695519407 0 ) 
     ( 0.6840622753076503 0.057257633334668184 0 ) 
     ( 0.6985739442796073 0.055166493047932835 0 ) 
     ( 0.7128896447431308 0.053060291248693305 0 ) 
      ( 0.7269952488302514 0.05094358941527154 0 ) 
      ( 0.7408768360127569 0.04882088036434985 0 ) 
      ( 0.7545207068400739 0.04669659388775366 0 ) 
     ( 0.7679133964589709 0.044575102741236876 0 ) 
     ( 0.7810416879017434 0.042460728715449876 0 ) 
      ( 0.7938926251297652 0.04035774852534163 0 ) 
       ( 0.8064535258195331 0.0382703992650045 0 ) 
      ( 0.8187119938785907 0.03620288319015597 0 ) 
      ( 0.8306559316789744 0.03415937160974301 0 ) 
     ( 0.8422735519961111 0.032144007691162185 0 ) 
      ( 0.853553389641386 0.030160908009871888 0 ) 
       ( 0.8644843127769004 0.0282141627032232 0 ) 
      ( 0.8750555339012502 0.02630783411962693 0 ) 
     ( 0.8852566204954886 0.024445953887123652 0 ) 
      ( 0.8950775053187623 0.02263251835944655 0 ) 
     ( 0.9045084963434626 0.020871482432147093 0 ) 
     ( 0.9135402863200868 0.019166751755690246 0 ) 
     ( 0.9221639619623694 0.017522173406010533 0 ) 
     ( 0.9303710127436202 0.015941525105270856 0 ) 
     ( 0.9381533392955854 0.014428503115926528 0 ) 
     ( 0.9455032614015477 0.012986708959144007 0 ) 
     ( 0.9524135255757721 0.011619635133683175 0 ) 
     ( 0.9588773122218202 0.010330650033101135 0 ) 
     ( 0.9648882423626697 0.009122982277207954 0 ) 
      ( 0.9704403839359932 0.00799970468780559 0 ) 
     ( 0.9755282576483886 0.006963718148641131 0 ) 
     ( 0.9801468423827797 0.006017735595046237 0 ) 
     ( 0.9842915801536527 0.005164266379846163 0 ) 
     ( 0.9879583806052372 0.004405601258790136 0 ) 
     ( 0.9911436250481941 0.003743798231068984 0 ) 
    ( 0.9938441700308243 0.0031806694585819065 0 ) 
    ( 0.9960573504412771 0.0027177694717267493 0 ) 
    ( 0.9977809821376927 0.0023563848499015562 0 ) 
    ( 0.9990133641036874 0.0020975255419717394 0 ) 
    ( 0.9997532801270506 0.0019419179661001593 0 ) 
                   ( 1.0 0.0018899999999999666 0 )  
  )
    spline 4 17
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.004169154968825117 1 ) 
  ( 0.0009866357836101902 -0.008281076632907582 1 ) 
  ( 0.0022190176933925554 -0.012334122703810159 1 ) 
   ( 0.003942649333762649 -0.016326255032679104 1 ) 
   ( 0.006155829688391956 -0.020255052161571765 1 ) 
     ( 0.008856374615475837 -0.0241177265817687 1 ) 
   ( 0.012041619003218151 -0.027911146491242964 1 ) 
    ( 0.015708419399974638 -0.03163186178898549 1 ) 
      ( 0.01985315711646002 -0.0352761339929874 1 ) 
     ( 0.02447174179695788 -0.03883996972203194 1 ) 
    ( 0.029559615456007327 -0.04231915733968087 1 ) 
      ( 0.03511175697658486 -0.0457093063225081 1 ) 
    ( 0.04112268706534028 -0.049005888884203236 1 ) 
    ( 0.047586473659998074 -0.05220428336303862 1 ) 
     ( 0.05449673778358616 -0.05529981886265408 1 ) 
     ( 0.06184665983971649 -0.05828782062537523 1 ) 
     ( 0.06962898634270315 -0.06116365561344123 1 ) 
     ( 0.07783603707587677 -0.06392277777658992 1 ) 
     ( 0.08645971267103159 -0.06656077249433519 1 ) 
      ( 0.0954915026015235 -0.06907339969778574 1 ) 
     ( 0.10492249358113281 -0.07145663519871454 1 ) 
     ( 0.11474337836040116 -0.07370670978242103 1 ) 
     ( 0.12494446491176331 -0.07582014565527825 1 ) 
      ( 0.13551568599440833 -0.0777937898771951 1 ) 
      ( 0.1464466090894303 -0.07962484445295025 1 ) 
      ( 0.1577264466954656 -0.08131089280381026 1 ) 
     ( 0.16934406697465365 -0.08284992239132666 1 ) 
     ( 0.18128800473841744 -0.08424034331796793 1 ) 
      ( 0.1935464727622202 -0.08548100278351592 1 ) 
     ( 0.20610737341813284 -0.08657119533115332 1 ) 
     ( 0.21895831061373222 -0.08751066887210364 1 ) 
      ( 0.2320866020255476 -0.08829962653177476 1 ) 
     ( 0.24547929161498316 -0.08893872441284553 1 ) 
      ( 0.2591231624143632 -0.08942906542088988 1 ) 
       ( 0.273004749570484 -0.08977218934526894 1 ) 
       ( 0.287110353632798 -0.08997005943150732 1 ) 
     ( 0.30142605407311807 -0.09002504572062502 1 ) 
       ( 0.315937723023497 -0.08993990546542407 1 ) 
      ( 0.3306310392187286 -0.08971776096309535 1 ) 
       ( 0.345491502129707 -0.08936207516737298 1 ) 
      ( 0.3605044462736979 -0.08887662546156153 1 ) 
      ( 0.3756550556873999 -0.08826547598592209 1 ) 
      ( 0.3909283785485107 -0.08753294891905451 1 ) 
     ( 0.40630934193137186 -0.08668359511306048 1 ) 
      ( 0.4217827666821252 -0.08572216447652817 1 ) 
     ( 0.43733338239870584 -0.08465357648792954 1 ) 
      ( 0.4529458425008854 -0.08348289120514711 1 ) 
       ( 0.468604739375493 -0.08221528111490378 1 ) 
      ( 0.4842946195818704 -0.08085600413928488 1 ) 
      ( 0.4999999991025516 -0.07941037808581562 1 ) 
      ( 0.5157053786241185 -0.07788375679323846 1 ) 
      ( 0.5313952588331522 -0.07628150818782539 1 ) 
       ( 0.5470541557121839 -0.0746089944254042 1 ) 
      ( 0.5626666158205507 -0.07287155425293544 1 ) 
      ( 0.5782172315450762 -0.07107448768113994 1 ) 
       ( 0.593690656305524 -0.06922304301703444 1 ) 
       ( 0.6090716196998196 -0.0673224062629689 1 ) 
      ( 0.6243449425740935 -0.06537769284755394 1 ) 
       ( 0.6394955520026742 -0.0633939416143527 1 ) 
     ( 0.6545084961632448 -0.061376110957014195 1 ) 
      ( 0.6693689590924875 -0.05932907695519407 1 ) 
     ( 0.6840622753076503 -0.057257633334668184 1 ) 
     ( 0.6985739442796073 -0.055166493047932835 1 ) 
     ( 0.7128896447431308 -0.053060291248693305 1 ) 
      ( 0.7269952488302514 -0.05094358941527154 1 ) 
      ( 0.7408768360127569 -0.04882088036434985 1 ) 
      ( 0.7545207068400739 -0.04669659388775366 1 ) 
     ( 0.7679133964589709 -0.044575102741236876 1 ) 
     ( 0.7810416879017434 -0.042460728715449876 1 ) 
      ( 0.7938926251297652 -0.04035774852534163 1 ) 
       ( 0.8064535258195331 -0.0382703992650045 1 ) 
      ( 0.8187119938785907 -0.03620288319015597 1 ) 
      ( 0.8306559316789744 -0.03415937160974301 1 ) 
     ( 0.8422735519961111 -0.032144007691162185 1 ) 
      ( 0.853553389641386 -0.030160908009871888 1 ) 
       ( 0.8644843127769004 -0.0282141627032232 1 ) 
      ( 0.8750555339012502 -0.02630783411962693 1 ) 
     ( 0.8852566204954886 -0.024445953887123652 1 ) 
      ( 0.8950775053187623 -0.02263251835944655 1 ) 
     ( 0.9045084963434626 -0.020871482432147093 1 ) 
     ( 0.9135402863200868 -0.019166751755690246 1 ) 
     ( 0.9221639619623694 -0.017522173406010533 1 ) 
     ( 0.9303710127436202 -0.015941525105270856 1 ) 
     ( 0.9381533392955854 -0.014428503115926528 1 ) 
     ( 0.9455032614015477 -0.012986708959144007 1 ) 
     ( 0.9524135255757721 -0.011619635133683175 1 ) 
     ( 0.9588773122218202 -0.010330650033101135 1 ) 
     ( 0.9648882423626697 -0.009122982277207954 1 ) 
      ( 0.9704403839359932 -0.00799970468780559 1 ) 
     ( 0.9755282576483886 -0.006963718148641131 1 ) 
     ( 0.9801468423827797 -0.006017735595046237 1 ) 
     ( 0.9842915801536527 -0.005164266379846163 1 ) 
     ( 0.9879583806052372 -0.004405601258790136 1 ) 
     ( 0.9911436250481941 -0.003743798231068984 1 ) 
    ( 0.9938441700308243 -0.0031806694585819065 1 ) 
    ( 0.9960573504412771 -0.0027177694717267493 1 ) 
    ( 0.9977809821376927 -0.0023563848499015562 1 ) 
    ( 0.9990133641036874 -0.0020975255419717394 1 ) 
    ( 0.9997532801270506 -0.0019419179661001593 1 ) 
                   ( 1.0 -0.0018899999999999666 1 )  
							
    )															
                                                                    
                                                                    
);																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                    
    boundary																
    (																
    inlet              // patch name																
            {																
                type patch;    // patch type for patch 0																
                faces																
                (																
                    (9 2 6 11)  // block face in this patch																
                    (2 3 7 6  )  // block face in this patch																
                    (3 12 13 7  )  // block face in this patch																
                    (12 15 14 13  )  // block face in this patch																
                );																
            } 																
                                                                    
    outlet              // patch name																
            {																
                type patch;    // patch type for patch 0																
                faces																
                (																
                    (8 9 10 11)  // block face in this patch																
                    //(18 8 19 10)  // block face in this patch	
                    (14 15 19 18) // block face in this patch																
                );																
            }																
                                                                    
    walls              // patch name																
            {																
                type wall;    // patch type for patch 0																
                faces																
                (																
                    (0 1 5 4)  // block face in this patch																
                    (0 4 17 16)  // block face in this patch	
                    //(1 16 17 5)  // block face in this patch															
                );																
            } 																
                                                                    		
    );	
// ************************************************************************* //	
