run/blockMesh_Test_1/system/blockMeshDict_working_example
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	12	0	)	//	2									
	(	-11	0	0	)	//	3									
	(	0	0	1	)	//	4									
	(	1	0	1	)	//	5									
	(	1	12	1	)	//	6									
	(	-11	0	1	)	//	7									
	(	21	1.83027059770082	0	)	//	8									
	(	21	12	0	)	//	9									
	(	21	1.83027059770082	1	)	//	10									
	(	21	12	1	)	//	11									
	(	1	-12	0	)	//	12									
	(	1	-12	1	)	//	13									
	(	21	-12	0	)	//	14									
	(	21	-12	1	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	1	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03	0.03														
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	13.9581659180375	13.9581659180375														
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.03															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03															
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	0.071642650321827	0.071642650321827														
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-7.48528137423857	8.48528137423857	0	)									
	arc	7 6 	(	-7.48528137423857	8.48528137423857	1	) 									
																
	spline	1 0													
	(															
(	0.999753280127051	0.0019419179661	0	)
(	0.999013364103687	0.002097525541972	0	)
(	0.997780982137693	0.002356384849902	0	)
(	0.996057350441277	0.002717769471727	0	)
(	0.993844170030824	0.003180669458582	0	)
(	0.991143625048194	0.003743798231069	0	)
(	0.987958380605237	0.00440560125879	0	)
(	0.984291580153653	0.005164266379846	0	)
(	0.98014684238278	0.006017735595046	0	)
(	0.975528257648389	0.006963718148641	0	)
(	0.970440383935993	0.007999704687806	0	)
(	0.96488824236267	0.009122982277208	0	)
(	0.95887731222182	0.010330650033101	0	)
(	0.952413525575772	0.011619635133683	0	)
(	0.945503261401548	0.012986708959144	0	)
(	0.938153339295585	0.014428503115927	0	)
(	0.93037101274362	0.015941525105271	0	)
(	0.922163961962369	0.017522173406011	0	)
(	0.913540286320087	0.01916675175569	0	)
(	0.904508496343463	0.020871482432147	0	)
(	0.895077505318762	0.022632518359447	0	)
(	0.885256620495488	0.024445953887124	0	)
(	0.87505553390125	0.026307834119627	0	)
(	0.8644843127769		0.028214162703223	0	)
(	0.853553389641386	0.030160908009872	0	)
(	0.842273551996111	0.032144007691162	0	)
(	0.830655931678974	0.034159371609743	0	)
(	0.818711993878591	0.036202883190156	0	)
(	0.806453525819533	0.038270399265005	0	)
(	0.793892625129765	0.040357748525342	0	)
(	0.781041687901743	0.04246072871545	0	)
(	0.767913396458971	0.044575102741237	0	)
(	0.754520706840074	0.046696593887754	0	)
(	0.740876836012757	0.04882088036435	0	)
(	0.726995248830251	0.050943589415272	0	)
(	0.712889644743131	0.053060291248693	0	)
(	0.698573944279607	0.055166493047933	0	)
(	0.68406227530765	0.057257633334668	0	)
(	0.669368959092487	0.059329076955194	0	)
(	0.654508496163245	0.061376110957014	0	)
(	0.639495552002674	0.063393941614353	0	)
(	0.624344942574093	0.065377692847554	0	)
(	0.60907161969982	0.067322406262969	0	)
(	0.593690656305524	0.069223043017035	0	)
(	0.578217231545076	0.07107448768114	0	)
(	0.562666615820551	0.072871554252936	0	)
(	0.547054155712184	0.074608994425404	0	)
(	0.531395258833152	0.076281508187825	0	)
(	0.515705378624118	0.077883756793239	0	)
(	0.499999999102552	0.079410378085816	0	)
(	0.48429461958187	0.080856004139285	0	)
(	0.468604739375493	0.082215281114904	0	)
(	0.452945842500885	0.083482891205147	0	)
(	0.437333382398706	0.08465357648793	0	)
(	0.421782766682125	0.085722164476528	0	)
(	0.406309341931372	0.086683595113061	0	)
(	0.390928378548511	0.087532948919055	0	)
(	0.3756550556874		0.088265475985922	0	)
(	0.360504446273698	0.088876625461562	0	)
(	0.345491502129707	0.089362075167373	0	)
(	0.330631039218729	0.089717760963095	0	)
(	0.315937723023497	0.089939905465424	0	)
(	0.301426054073118	0.090025045720625	0	)
(	0.287110353632798	0.089970059431507	0	)
(	0.273004749570484	0.089772189345269	0	)
(	0.259123162414363	0.08942906542089	0	)
(	0.245479291614983	0.088938724412846	0	)
(	0.232086602025548	0.088299626531775	0	)
(	0.218958310613732	0.087510668872104	0	)
(	0.206107373418133	0.086571195331153	0	)
(	0.19354647276222	0.085481002783516	0	)
(	0.181288004738417	0.084240343317968	0	)
(	0.169344066974654	0.082849922391327	0	)
(	0.157726446695466	0.08131089280381	0	)
(	0.14644660908943	0.07962484445295	0	)
(	0.135515685994408	0.077793789877195	0	)
(	0.124944464911763	0.075820145655278	0	)
(	0.114743378360401	0.073706709782421	0	)
(	0.104922493581133	0.071456635198715	0	)
(	0.095491502601524	0.069073399697786	0	)
(	0.086459712671032	0.066560772494335	0	)
(	0.077836037075877	0.06392277777659	0	)
(	0.069628986342703	0.061163655613441	0	)
(	0.061846659839717	0.058287820625375	0	)
(	0.054496737783586	0.055299818862654	0	)
(	0.047586473659998	0.052204283363039	0	)
(	0.04112268706534	0.049005888884203	0	)
(	0.035111756976585	0.045709306322508	0	)
(	0.029559615456007	0.042319157339681	0	)
(	0.024471741796958	0.038839969722032	0	)
(	0.01985315711646	0.035276133992987	0	)
(	0.015708419399975	0.031631861788986	0	)
(	0.012041619003218	0.027911146491243	0	)
(	0.008856374615476	0.024117726581769	0	)
(	0.006155829688392	0.020255052161572	0	)
(	0.003942649333763	0.016326255032679	0	)
(	0.002219017693393	0.01233412270381	0	)
(	0.00098663578361	0.008281076632908	0	)
(	0.00024671981657	0.004169154968825	0	)
	)															
																
																
	spline	5	4													
	(															
(	0.999753280127051	0.0019419179661	1	)
(	0.999013364103687	0.002097525541972	1	)
(	0.997780982137693	0.002356384849902	1	)
(	0.996057350441277	0.002717769471727	1	)
(	0.993844170030824	0.003180669458582	1	)
(	0.991143625048194	0.003743798231069	1	)
(	0.987958380605237	0.00440560125879	1	)
(	0.984291580153653	0.005164266379846	1	)
(	0.98014684238278	0.006017735595046	1	)
(	0.975528257648389	0.006963718148641	1	)
(	0.970440383935993	0.007999704687806	1	)
(	0.96488824236267	0.009122982277208	1	)
(	0.95887731222182	0.010330650033101	1	)
(	0.952413525575772	0.011619635133683	1	)
(	0.945503261401548	0.012986708959144	1	)
(	0.938153339295585	0.014428503115927	1	)
(	0.93037101274362	0.015941525105271	1	)
(	0.922163961962369	0.017522173406011	1	)
(	0.913540286320087	0.01916675175569	1	)
(	0.904508496343463	0.020871482432147	1	)
(	0.895077505318762	0.022632518359447	1	)
(	0.885256620495488	0.024445953887124	1	)
(	0.87505553390125	0.026307834119627	1	)
(	0.8644843127769	0.028214162703223	1	)
(	0.853553389641386	0.030160908009872	1	)
(	0.842273551996111	0.032144007691162	1	)
(	0.830655931678974	0.034159371609743	1	)
(	0.818711993878591	0.036202883190156	1	)
(	0.806453525819533	0.038270399265005	1	)
(	0.793892625129765	0.040357748525342	1	)
(	0.781041687901743	0.04246072871545	1	)
(	0.767913396458971	0.044575102741237	1	)
(	0.754520706840074	0.046696593887754	1	)
(	0.740876836012757	0.04882088036435	1	)
(	0.726995248830251	0.050943589415272	1	)
(	0.712889644743131	0.053060291248693	1	)
(	0.698573944279607	0.055166493047933	1	)
(	0.68406227530765	0.057257633334668	1	)
(	0.669368959092487	0.059329076955194	1	)
(	0.654508496163245	0.061376110957014	1	)
(	0.639495552002674	0.063393941614353	1	)
(	0.624344942574093	0.065377692847554	1	)
(	0.60907161969982	0.067322406262969	1	)
(	0.593690656305524	0.069223043017035	1	)
(	0.578217231545076	0.07107448768114	1	)
(	0.562666615820551	0.072871554252936	1	)
(	0.547054155712184	0.074608994425404	1	)
(	0.531395258833152	0.076281508187825	1	)
(	0.515705378624118	0.077883756793239	1	)
(	0.499999999102552	0.079410378085816	1	)
(	0.48429461958187	0.080856004139285	1	)
(	0.468604739375493	0.082215281114904	1	)
(	0.452945842500885	0.083482891205147	1	)
(	0.437333382398706	0.08465357648793	1	)
(	0.421782766682125	0.085722164476528	1	)
(	0.406309341931372	0.086683595113061	1	)
(	0.390928378548511	0.087532948919055	1	)
(	0.3756550556874	0.088265475985922	1	)
(	0.360504446273698	0.088876625461562	1	)
(	0.345491502129707	0.089362075167373	1	)
(	0.330631039218729	0.089717760963095	1	)
(	0.315937723023497	0.089939905465424	1	)
(	0.301426054073118	0.090025045720625	1	)
(	0.287110353632798	0.089970059431507	1	)
(	0.273004749570484	0.089772189345269	1	)
(	0.259123162414363	0.08942906542089	1	)
(	0.245479291614983	0.088938724412846	1	)
(	0.232086602025548	0.088299626531775	1	)
(	0.218958310613732	0.087510668872104	1	)
(	0.206107373418133	0.086571195331153	1	)
(	0.19354647276222	0.085481002783516	1	)
(	0.181288004738417	0.084240343317968	1	)
(	0.169344066974654	0.082849922391327	1	)
(	0.157726446695466	0.08131089280381	1	)
(	0.14644660908943	0.07962484445295	1	)
(	0.135515685994408	0.077793789877195	1	)
(	0.124944464911763	0.075820145655278	1	)
(	0.114743378360401	0.073706709782421	1	)
(	0.104922493581133	0.071456635198715	1	)
(	0.095491502601524	0.069073399697786	1	)
(	0.086459712671032	0.066560772494335	1	)
(	0.077836037075877	0.06392277777659	1	)
(	0.069628986342703	0.061163655613441	1	)
(	0.061846659839717	0.058287820625375	1	)
(	0.054496737783586	0.055299818862654	1	)
(	0.047586473659998	0.052204283363039	1	)
(	0.04112268706534	0.049005888884203	1	)
(	0.035111756976585	0.045709306322508	1	)
(	0.029559615456007	0.042319157339681	1	)
(	0.024471741796958	0.038839969722032	1	)
(	0.01985315711646	0.035276133992987	1	)
(	0.015708419399975	0.031631861788986	1	)
(	0.012041619003218	0.027911146491243	1	)
(	0.008856374615476	0.024117726581769	1	)
(	0.006155829688392	0.020255052161572	1	)
(	0.003942649333763	0.016326255032679	1	)
(	0.002219017693393	0.01233412270381	1	)
(	0.00098663578361	0.008281076632908	1	)
(	0.00024671981657	0.004169154968825	1	)
									
	)															
																
																
	arc	3 12	(	-7.48528137423857	-8.48528137423857	0	)									
	arc	7 13	(	-7.48528137423857	-8.48528137423857	1	)									
																
	spline	0	16													
	(															
	(	0.00024671981657	-0.004169154968825	0	)
(	0.00098663578361	-0.008281076632908	0	)
(	0.002219017693393	-0.01233412270381	0	)
(	0.003942649333763	-0.016326255032679	0	)
(	0.006155829688392	-0.020255052161572	0	)
(	0.008856374615476	-0.024117726581769	0	)
(	0.012041619003218	-0.027911146491243	0	)
(	0.015708419399975	-0.031631861788986	0	)
(	0.01985315711646	-0.035276133992987	0	)
(	0.024471741796958	-0.038839969722032	0	)
(	0.029559615456007	-0.042319157339681	0	)
(	0.035111756976585	-0.045709306322508	0	)
(	0.04112268706534	-0.049005888884203	0	)
(	0.047586473659998	-0.052204283363039	0	)
(	0.054496737783586	-0.055299818862654	0	)
(	0.061846659839717	-0.058287820625375	0	)
(	0.069628986342703	-0.061163655613441	0	)
(	0.077836037075877	-0.06392277777659	0	)
(	0.086459712671032	-0.066560772494335	0	)
(	0.095491502601524	-0.069073399697786	0	)
(	0.104922493581133	-0.071456635198715	0	)
(	0.114743378360401	-0.073706709782421	0	)
(	0.124944464911763	-0.075820145655278	0	)
(	0.135515685994408	-0.077793789877195	0	)
(	0.14644660908943	-0.07962484445295	0	)
(	0.157726446695466	-0.08131089280381	0	)
(	0.169344066974654	-0.082849922391327	0	)
(	0.181288004738417	-0.084240343317968	0	)
(	0.19354647276222	-0.085481002783516	0	)
(	0.206107373418133	-0.086571195331153	0	)
(	0.218958310613732	-0.087510668872104	0	)
(	0.232086602025548	-0.088299626531775	0	)
(	0.245479291614983	-0.088938724412846	0	)
(	0.259123162414363	-0.08942906542089	0	)
(	0.273004749570484	-0.089772189345269	0	)
(	0.287110353632798	-0.089970059431507	0	)
(	0.301426054073118	-0.090025045720625	0	)
(	0.315937723023497	-0.089939905465424	0	)
(	0.330631039218729	-0.089717760963095	0	)
(	0.345491502129707	-0.089362075167373	0	)
(	0.360504446273698	-0.088876625461562	0	)
(	0.3756550556874	-0.088265475985922	0	)
(	0.390928378548511	-0.087532948919055	0	)
(	0.406309341931372	-0.086683595113061	0	)
(	0.421782766682125	-0.085722164476528	0	)
(	0.437333382398706	-0.08465357648793	0	)
(	0.452945842500885	-0.083482891205147	0	)
(	0.468604739375493	-0.082215281114904	0	)
(	0.48429461958187	-0.080856004139285	0	)
(	0.499999999102552	-0.079410378085816	0	)
(	0.515705378624118	-0.077883756793239	0	)
(	0.531395258833152	-0.076281508187825	0	)
(	0.547054155712184	-0.074608994425404	0	)
(	0.562666615820551	-0.072871554252936	0	)
(	0.578217231545076	-0.07107448768114	0	)
(	0.593690656305524	-0.069223043017035	0	)
(	0.60907161969982	-0.067322406262969	0	)
(	0.624344942574093	-0.065377692847554	0	)
(	0.639495552002674	-0.063393941614353	0	)
(	0.654508496163245	-0.061376110957014	0	)
(	0.669368959092487	-0.059329076955194	0	)
(	0.68406227530765	-0.057257633334668	0	)
(	0.698573944279607	-0.055166493047933	0	)
(	0.712889644743131	-0.053060291248693	0	)
(	0.726995248830251	-0.050943589415272	0	)
(	0.740876836012757	-0.04882088036435	0	)
(	0.754520706840074	-0.046696593887754	0	)
(	0.767913396458971	-0.044575102741237	0	)
(	0.781041687901743	-0.04246072871545	0	)
(	0.793892625129765	-0.040357748525342	0	)
(	0.806453525819533	-0.038270399265005	0	)
(	0.818711993878591	-0.036202883190156	0	)
(	0.830655931678974	-0.034159371609743	0	)
(	0.842273551996111	-0.032144007691162	0	)
(	0.853553389641386	-0.030160908009872	0	)
(	0.8644843127769	-0.028214162703223	0	)
(	0.87505553390125	-0.026307834119627	0	)
(	0.885256620495488	-0.024445953887124	0	)
(	0.895077505318762	-0.022632518359447	0	)
(	0.904508496343463	-0.020871482432147	0	)
(	0.913540286320087	-0.01916675175569	0	)
(	0.922163961962369	-0.017522173406011	0	)
(	0.93037101274362	-0.015941525105271	0	)
(	0.938153339295585	-0.014428503115927	0	)
(	0.945503261401548	-0.012986708959144	0	)
(	0.952413525575772	-0.011619635133683	0	)
(	0.95887731222182	-0.010330650033101	0	)
(	0.96488824236267	-0.009122982277208	0	)
(	0.970440383935993	-0.007999704687806	0	)
(	0.975528257648389	-0.006963718148641	0	)
(	0.98014684238278	-0.006017735595046	0	)
(	0.984291580153653	-0.005164266379846	0	)
(	0.987958380605237	-0.00440560125879	0	)
(	0.991143625048194	-0.003743798231069	0	)
(	0.993844170030824	-0.003180669458582	0	)
(	0.996057350441277	-0.002717769471727	0	)
(	0.997780982137693	-0.002356384849902	0	)
(	0.999013364103687	-0.002097525541972	0	)
(	0.999753280127051	-0.0019419179661	0	)									
	)															
																
																
	spline	4	17													
	(															
(	0.00024671981657	-0.004169154968825	1	)
(	0.00098663578361	-0.008281076632908	1	)
(	0.002219017693393	-0.01233412270381	1	)
(	0.003942649333763	-0.016326255032679	1	)
(	0.006155829688392	-0.020255052161572	1	)
(	0.008856374615476	-0.024117726581769	1	)
(	0.012041619003218	-0.027911146491243	1	)
(	0.015708419399975	-0.031631861788986	1	)
(	0.01985315711646	-0.035276133992987	1	)
(	0.024471741796958	-0.038839969722032	1	)
(	0.029559615456007	-0.042319157339681	1	)
(	0.035111756976585	-0.045709306322508	1	)
(	0.04112268706534	-0.049005888884203	1	)
(	0.047586473659998	-0.052204283363039	1	)
(	0.054496737783586	-0.055299818862654	1	)
(	0.061846659839717	-0.058287820625375	1	)
(	0.069628986342703	-0.061163655613441	1	)
(	0.077836037075877	-0.06392277777659	1	)
(	0.086459712671032	-0.066560772494335	1	)
(	0.095491502601524	-0.069073399697786	1	)
(	0.104922493581133	-0.071456635198715	1	)
(	0.114743378360401	-0.073706709782421	1	)
(	0.124944464911763	-0.075820145655278	1	)
(	0.135515685994408	-0.077793789877195	1	)
(	0.14644660908943	-0.07962484445295	1	)
(	0.157726446695466	-0.08131089280381	1	)
(	0.169344066974654	-0.082849922391327	1	)
(	0.181288004738417	-0.084240343317968	1	)
(	0.19354647276222	-0.085481002783516	1	)
(	0.206107373418133	-0.086571195331153	1	)
(	0.218958310613732	-0.087510668872104	1	)
(	0.232086602025548	-0.088299626531775	1	)
(	0.245479291614983	-0.088938724412846	1	)
(	0.259123162414363	-0.08942906542089	1	)
(	0.273004749570484	-0.089772189345269	1	)
(	0.287110353632798	-0.089970059431507	1	)
(	0.301426054073118	-0.090025045720625	1	)
(	0.315937723023497	-0.089939905465424	1	)
(	0.330631039218729	-0.089717760963095	1	)
(	0.345491502129707	-0.089362075167373	1	)
(	0.360504446273698	-0.088876625461562	1	)
(	0.3756550556874	-0.088265475985922	1	)
(	0.390928378548511	-0.087532948919055	1	)
(	0.406309341931372	-0.086683595113061	1	)
(	0.421782766682125	-0.085722164476528	1	)
(	0.437333382398706	-0.08465357648793	1	)
(	0.452945842500885	-0.083482891205147	1	)
(	0.468604739375493	-0.082215281114904	1	)
(	0.48429461958187	-0.080856004139285	1	)
(	0.499999999102552	-0.079410378085816	1	)
(	0.515705378624118	-0.077883756793239	1	)
(	0.531395258833152	-0.076281508187825	1	)
(	0.547054155712184	-0.074608994425404	1	)
(	0.562666615820551	-0.072871554252936	1	)
(	0.578217231545076	-0.07107448768114	1	)
(	0.593690656305524	-0.069223043017035	1	)
(	0.60907161969982	-0.067322406262969	1	)
(	0.624344942574093	-0.065377692847554	1	)
(	0.639495552002674	-0.063393941614353	1	)
(	0.654508496163245	-0.061376110957014	1	)
(	0.669368959092487	-0.059329076955194	1	)
(	0.68406227530765	-0.057257633334668	1	)
(	0.698573944279607	-0.055166493047933	1	)
(	0.712889644743131	-0.053060291248693	1	)
(	0.726995248830251	-0.050943589415272	1	)
(	0.740876836012757	-0.04882088036435	1	)
(	0.754520706840074	-0.046696593887754	1	)
(	0.767913396458971	-0.044575102741237	1	)
(	0.781041687901743	-0.04246072871545	1	)
(	0.793892625129765	-0.040357748525342	1	)
(	0.806453525819533	-0.038270399265005	1	)
(	0.818711993878591	-0.036202883190156	1	)
(	0.830655931678974	-0.034159371609743	1	)
(	0.842273551996111	-0.032144007691162	1	)
(	0.853553389641386	-0.030160908009872	1	)
(	0.8644843127769	-0.028214162703223	1	)
(	0.87505553390125	-0.026307834119627	1	)
(	0.885256620495488	-0.024445953887124	1	)
(	0.895077505318762	-0.022632518359447	1	)
(	0.904508496343463	-0.020871482432147	1	)
(	0.913540286320087	-0.01916675175569	1	)
(	0.922163961962369	-0.017522173406011	1	)
(	0.93037101274362	-0.015941525105271	1	)
(	0.938153339295585	-0.014428503115927	1	)
(	0.945503261401548	-0.012986708959144	1	)
(	0.952413525575772	-0.011619635133683	1	)
(	0.95887731222182	-0.010330650033101	1	)
(	0.96488824236267	-0.009122982277208	1	)
(	0.970440383935993	-0.007999704687806	1	)
(	0.975528257648389	-0.006963718148641	1	)
(	0.98014684238278	-0.006017735595046	1	)
(	0.984291580153653	-0.005164266379846	1	)
(	0.987958380605237	-0.00440560125879	1	)
(	0.991143625048194	-0.003743798231069	1	)
(	0.993844170030824	-0.003180669458582	1	)
(	0.996057350441277	-0.002717769471727	1	)
(	0.997780982137693	-0.002356384849902	1	)
(	0.999013364103687	-0.002097525541972	1	)
(	0.999753280127051	-0.0019419179661	1	)
							
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
walls              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																

